---
kind: enumMember
id: F:Autodesk.Revit.DB.OpenForeignOption.DoNotOpen
enum: Autodesk.Revit.DB.OpenForeignOption
source: html/c8247945-7f12-a435-35e0-0879b02d4397.htm
---
# Autodesk.Revit.DB.OpenForeignOption.DoNotOpen

Do not show any prompt to the user if a foreign file is detected. Cancel this operation (do not open the file).